** Create and manipulate geometries
#+BEGIN_SRC python :results output
  import astra
  import numpy as np
  import tomosipo as ts

  # Create 'unit' cone geometry
  pg = ts.cone(angles=100)
  print(pg)

  # Create volume geometry of a unit cube on the origin
  vg = ts.volume()
  print(vg)

  # Display an animation of the acquisition geometry
  ts.display_geometry(pg, vg)

  # Get a volume geometry that fits in the cone beam:
  v_inside = ts.volume_from_projection_geometry(pg, inside=True)
  v_outside = ts.volume_from_projection_geometry(pg, inside=False)
  print(v_inside)
  print(v_outside)
  # Animate the geometries:
  ts.display_geometry(pg, v_inside)
  ts.display_geometry(pg, v_outside)
#+END_SRC

#+RESULTS:
#+begin_example
ConeGeometry(
    angles=100,
    size=(1.4142135623730951, 1.4142135623730951),
    shape=(1, 1),
    detector_distance=0,
    source_distance=2
)
VolumeGeometry < extent: ((-0.5, 0.5), (-0.5, 0.5), (-0.5, 0.5)), shape: (1, 1, 1)>
VolumeGeometry < extent: ((-0.47151685419122136, 0.47151685419122136), (-0.47141208716416366, 0.47141208716416366), (-0.47141208716416366, 0.47141208716416366)), shape: (1, 1, 1)>
VolumeGeometry < extent: ((-0.7071067811865476, 0.7071067811865476), (-1.0938365340665575, 1.0938365340665575), (-1.0938365340665575, 1.0938365340665575)), shape: (1, 1, 1)>
VolumeGeometry < extent: ((-0.7071067811865476, 0.7071067811865476), (-1.0938365340665575, 1.0938365340665575), (-1.0938365340665575, 1.0938365340665575)), shape: (1, 1, 1)>
#+end_example
